In [1]:
import pandas as pd
import os

In [2]:
PATH = "../Datasets/Temperature/"

In [3]:
titles = os.listdir(PATH)

Reading files

In [4]:
df = pd.read_excel(PATH + titles[0])

In [5]:
df

      Parámetro       Fecha  valor Unidad
0           NaN         NaN    NaN    NaN
1           TMP  2018-03-02   18.2     °C
2           TMP  2018-03-02   17.8     °C
3           TMP  2018-03-02   16.9     °C
4           TMP  2018-03-02   16.1     °C
...         ...         ...    ...    ...
17313       TMP  2020-03-02   23.8     °C
17314       TMP  2020-03-02   22.0     °C
17315       TMP  2020-03-02   20.9     °C
17316       TMP  2020-03-02   19.8     °C
17317       TMP  2020-03-02   18.5     °C

[17318 rows x 4 columns]

Dropping empty instances

In [6]:
df.dropna(how='all', inplace=True)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17317 entries, 1 to 17317
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  17317 non-null  object
 1   Fecha      17317 non-null  object
 2   valor      17317 non-null  float64
 3   Unidad     17317 non-null  object
dtypes: float64(1), object(3)
memory usage: 676.4+ KB

Creating the complete dataset

In [8]:
for df_i in titles[1:]:
    df_i = pd.read_excel(PATH + df_i)
    df_i = df_i.dropna(how='all')
    df = pd.concat([df, df_i], axis=0)

In [9]:
df

     Parámetro       Fecha  valor Unidad
1          TMP  2018-03-02   18.2     °C
2          TMP  2018-03-02   17.8     °C
3          TMP  2018-03-02   16.9     °C
4          TMP  2018-03-02   16.1     °C
5          TMP  2018-03-02   15.4     °C
...        ...         ...    ...    ...
7546       TMP  2025-03-09   28.6     °C
7547       TMP  2025-03-09   29.1     °C
7548       TMP  2025-03-09   29.1     °C
7549       TMP  2025-03-09   29.0     °C
7550       TMP  2025-03-09   27.9     °C

[55499 rows x 4 columns]

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 55499 entries, 1 to 7550
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Parámetro  55499 non-null  object
 1   Fecha      55499 non-null  object
 2   valor      55499 non-null  float64
 3   Unidad     55499 non-null  object
dtypes: float64(1), object(3)
memory usage: 2.1+ MB

Dropping unnecessary columns

In [11]:
df.drop(["Parámetro", "Unidad"], axis=1, inplace=True)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 55499 entries, 1 to 7550
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Fecha   55499 non-null  object
 1   valor   55499 non-null  float64
dtypes: float64(1), object(1)
memory usage: 1.3+ MB

Formating dates

In [13]:
df["Fecha"] = pd.to_datetime(df["Fecha"])

In [14]:
df.head()

       Fecha  valor
1 2018-03-02   18.2
2 2018-03-02   17.8
3 2018-03-02   16.9
4 2018-03-02   16.1
5 2018-03-02   15.4

Changing column names

In [15]:
df.rename(columns={"valor":"Temperatura"}, inplace=True)

In [16]:
df

          Fecha  Temperatura
1    2018-03-02         18.2
2    2018-03-02         17.8
3    2018-03-02         16.9
4    2018-03-02         16.1
5    2018-03-02         15.4
...         ...          ...
7546 2025-03-09         28.6
7547 2025-03-09         29.1
7548 2025-03-09         29.1
7549 2025-03-09         29.0
7550 2025-03-09         27.9

[55499 rows x 2 columns]

Grouping per day and taking in consideration the average

In [17]:
df = df.groupby("Fecha", as_index=False).mean()

In [18]:
df

          Fecha  Temperatura
0    2018-03-02    20.625000
1    2018-03-03    20.354167
2    2018-03-04    20.358333
3    2018-03-05    20.362500
4    2018-03-06    20.320833
...         ...          ...
2336 2025-03-05    20.816667
2337 2025-03-06    20.087500
2338 2025-03-07    19.862500
2339 2025-03-08    20.237500
2340 2025-03-09    19.978947

[2341 rows x 2 columns]

In [20]:
df.to_csv(PATH + "Temperature.csv", index=False)